events/Data Storage Events/Metadata.forumPost/Metadata.forumPost.requestNew.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<s:Header></s:Header>
	<s:Body>
		<wsnt:Notify>
			<wsnt:NotificationMessage>
				<wsnt:Topic></wsnt:Topic>
				<wsnt:ProducerReference>
					<wsa:Address>http://www.alert-project.eu/keui</wsa:Address>
				</wsnt:ProducerReference>
				<wsnt:Message>
					<ns1:event xmlns:ns1="http://www.alert-project.eu/"	xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki"	xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
						<ns1:head>
							<ns1:sender>KEUI</ns1:sender>
							<ns1:timestamp>10000</ns1:timestamp>
							<ns1:sequencenumber>1</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
							<ns1:meta>
								<ns1:startTime>10010</ns1:startTime>
								<ns1:endTime>10010</ns1:endTime>
								<!-- name of event -->
								<ns1:eventName>Metadata.forumPost.requestNew</ns1:eventName>
								<ns1:eventId>5748</ns1:eventId>
								<ns1:eventType>request</ns1:eventType>
							</ns1:meta>
							<ns1:eventData>
								<s1:forum>
									<!-- forum item ID -->
									<s1:forumItemId>3557</s1:forumItemId>
                                                                        <!-- forum ID -->
									<s1:forumId>3558</s1:forumId>
									<!-- thread ID -->
									<s1:threadId>3559</s1:threadId>
									<!-- post ID -->
									<s1:postId>3560</s1:postId>
									<!-- time -->
									<s1:time>100001</s1:time>
									<!-- subject -->
									<s1:subject>This is a test subject for post</s1:subject>
									<!-- body -->
									<s1:body>This is a test body for post</s1:body>
									<!-- author -->
									<s1:author>
										<s1:name>Angel Blue</s1:name>
										<s1:id>angel_blue_co2004@yahoo.com</s1:id>
										<s1:email>angel_blue_co2004@yahoo.com</s1:email>
									</s1:author>
									<!-- category -->
									<s1:category>xxxxxx</s1:category>
								</s1:forum>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</s:Body>
</s:Envelope>